P=perms(1:1:10);
n=0;
s=204.578012;
 for i=1:size(P,1)%计算总的情况数，即看矩阵P有多少行，每行就是一种情况
     t2=0;
     dt=0;
     t1=sum(a22(P(i,1)));%这就是第i种情况下，按顺序下的第1种疫苗的时间
     for j=2:10%对P第i行情况进行遍历
        
         ss=a22(P(i,j));
         sss=a22(P(i,j-1));
         t2=ss(1,4)+t2;
         for k=1:3
             if ss(1,k)>sss(1,k+1)
                 dt=dt+ss(1,k)-sss(1,k+1);
             end
         end
     end
     t=t1+t2+dt;
     if t==s
        fprintf('最短时间情况下的顺序为：');
        fprintf('%d',P(i,:));
        n=n+1;
     end
 end
 fprintf('\n');
 fprintf('有%d种方案是最短情况',n)


function ym  = a22( n )
x1 = [13.284036 14.962134 19.846022 20.012922];
x2 = [9.87088 19.907534 17.928158 18.942358];
x3 = [20.05841 15.97263 14.97035 15.11639];
x4 = [7.988652 9.936646 5.935868 18.1284];
x5 = [8.770062 13.72201 13.00521 11.24949];
x6 = [19.07412 20.09436 14.14853 13.88388];
x7 = [11.16015 16.49615 12.01366 19.0876];
x8 = [16.0201 8.82748 18.11438 16.83139];
x9 = [15.0146 12.03512 7.041914 8.949654];
x10 = [12.95245 7.010982 9.04917 16.05241];
y=[x1;x2;x3;x4;x5;x6;x7;x8;x9;x10];
ym=y(n,:);
end
