u = [13.284036 14.962134 19.846022 20.012922
9.87088 19.907534 17.928158 18.942358
20.05841 15.97263 14.97035 15.11639
7.988652 9.936646 5.935868 18.1284
8.770062 13.72201 13.00521 11.24949
19.07412 20.09436 14.14853 13.88388
11.16015 16.49615 12.01366 19.0876
16.0201 8.82748 18.11438 16.83139
15.0146 12.03512 7.041914 8.949654
12.95245 7.010982 9.04917 16.05241];%均值矩阵

g = [1.593979267 1.083080773 1.187504623 1.889732296
0.833284616 1.252911278 0.90218502 0.890484536
0.844790782 0.693394179 1.040037276 0.812172135
0.932171113 0.953390968 0.037996434 1.127715579
0.745089073 1.139570724 0.831301091 1.230827731
1.334985544 0.973471333 0.875459281 1.151731145
1.026306801 0.929460647 0.786215725 0.656362277
1.131725211 0.261407527 1.070011342 0.912768772
0.973807391 1.158074689 0.133662712 0.17519503
0.207491463 0.282183874 0.207364088 0.263394334];%方差矩阵

NN=zeros(40,8);
NNN=zeros(10,4);
count=0;
count2=0;
NNNN=zeros(10,4);
NB=zeros(10,10);
 for i=1:10
     for j=1:4
        count=count+1;
        x=(u(i,j)-2*sqrt(g(i,j))):(sqrt(g(i,j))/2):(u(i,j)+2*sqrt(g(i,j)));
        X=[x];
        N=normpdf(x,u(i,j),sqrt(g(i,j)));
        n=length(X);
        for k=1:n
            NN(count,k)=X(1,k);
        end
    end
 end
 
 for jj=1:8
    for i=1:40
       m=mod(i,4);
       if m==0
          m=4;
       end
       NNN(ceil(i/4),m) = NN(i,jj);
    end
    
    P=perms(1:1:10);
    s=204.578012*0.95;
     for i=1:size(P,1)%计算总的情况数，即看矩阵P有多少行，每行就是一种情况
         t2=0;
         dt=0;
         t1=sum(NNN(P(i,1),:));%这就是第i种情况下，按顺序下的第1种疫苗的时间
         for j=2:10%对P第i行情况进行遍历
             ss=NNN(P(i,j),:);
             sss=NNN(P(i,j-1),:);
             t2=ss(1,4)+t2;
             for k=1:3
                 if ss(1,k)>sss(1,k+1)
                     dt=dt+ss(1,k)-sss(1,k+1);
                 end
             end
         end
         t=t1+t2+dt;
         if t<=s
            count2=count2+1;
            for k=1:10
                switch P(i,k)
                    case 1
                        NB(1,k)=NB(1,k)+1;
                    case 2
                        NB(2,k)=NB(2,k)+1;
                    case 3
                        NB(3,k)=NB(3,k)+1;
                    case 4
                        NB(4,k)=NB(4,k)+1;
                    case 5
                        NB(5,k)=NB(5,k)+1;
                    case 6
                        NB(6,k)=NB(6,k)+1;
                    case 7
                        NB(7,k)=NB(7,k)+1;
                    case 8
                        NB(8,k)=NB(8,k)+1;
                    case 9
                        NB(9,k)=NB(9,k)+1;
                    case 10
                        NB(10,k)=NB(10,k)+1;
                end
            end
         end
     end
 end
 fprintf('\n 共count2=%d种方案',count2);
 for i=1:10
      for j=1:10
          fprintf(' %f',NB(i,j));
      end
      fprintf('\n');
      end